// Ссылки
let links : {
    [key: string]: any // whatever type of array
} = {

    'razrabotka-saitov':
                        {
                            h1: 'Разработка сайта «под ключ» в Волгограде',
                            img: '1',
                            textUp: 'Разработка сайтов – это комплексный процесс создания веб-проекта, который включает в себя несколько важных этапов. В современном мире веб-сайт является неотъемлемой частью бизнеса, он позволяет компаниям представить свои продукты и услуги в онлайн-пространстве, привлечь новых клиентов и поддерживать взаимодействие с уже существующими.',
                            price: '8000',
                            h2: 'Разработка сайта с гарантиями!',
                            textMain: 'Первым шагом в разработке сайта является анализ и планирование. Здесь необходимо определить цели и задачи сайта, целевую аудиторию, исследовать конкурентов и провести анализ их веб-присутствия. На основе этих данных создается концепция и структура сайта, а также определяются основные функциональные и дизайнерские требования.<br>Следующим этапом является разработка дизайна. Дизайн сайта играет важную роль в создании привлекательного и удобного интерфейса для пользователей. Это включает выбор цветовой схемы, шрифтов, компоновку элементов и создание визуального контента, такого как логотипы, изображения и иллюстрации. Важно учесть, что дизайн сайта должен быть адаптивным, чтобы корректно отображаться на различных устройствах и экранах.<br>После этого следует этап программирования и разработки технической части сайта. Здесь создаются веб-страницы, функциональные модули, базы данных и другие технические элементы. Применяются языки программирования, такие как HTML, CSS, JavaScript, а также используются современные фреймворки и CMS (системы управления контентом) для упрощения процесса разработки.',
                            title: 'Разработка сайтов в Волгограде по Выгодным ценам! компания SEO-FiRST', 
                            description: 'Доступные цены на разработку сайтов в Волгограде. Большое портфолио и качественное портфолио! Самые конкурентные цены и сроки. Строгие гарантии на результат и сроки со 100% возвратом денег!'
                        },
    'landing-page':
                        {
                            h1: 'Разработка лендинга (landing page) "под ключ"',
                            img: '11',
                            textUp: 'Разработка лендинг страниц – это ключевой этап создания успешных онлайн-проектов. Лендинг, или целевая страница, представляет собой специально разработанную веб-страницу, целью которой является привлечение посетителей и убеждение их совершить определенное действие, такое как оформление покупки, подписка на рассылку или регистрация.',
                            price: '12000',
                            h2: 'Разработка лендинга (landing page) с гарантией!',
                            textMain: '<p>Процесс разработки лендинг страницы включает несколько ключевых этапов. Вначале проводится анализ целевой аудитории и определение ее потребностей и ожиданий. Исследование конкурентной среды также является неотъемлемой частью этапа планирования.<br>После этого следует создание дизайна лендинг страницы, который должен быть привлекательным, современным и соответствовать бренду или продукту. Важно учесть мобильную адаптивность, чтобы лендинг страница отображалась корректно на различных устройствах и экранах.<br>Кроме того, разработка лендинг страницы включает в себя создание продающего контента. Тексты должны быть ясными, убедительными и информативными, привлекая внимание посетителей и описывая преимущества предлагаемого продукта или услуги. Также важно использовать сильные заголовки, подзаголовки и выделение ключевых моментов, чтобы посетители могли быстро ознакомиться с основными преимуществами.</p>',
                            title: 'Разработка лендинга (landing page) в Волгограде по Выгодным ценам! компания SEO-FiRST', 
                            description: 'На рынке с 2009г. Закажите разработка лендинга (landing page) у нас! Большое портфолио. Выполняем сложные и уникальные работы. '
                        },
    'site-vizitka':
                        {
                            h1: 'Разработка сайта-визитки «под ключ»',
                            img: '12',
                            textUp: 'В наше современное цифровое время, иметь присутствие в интернете является необходимостью для любого бизнеса. Один из самых простых и эффективных способов представить свою компанию, продукты или услуги онлайн - это создание сайта-визитки. Сайт-визитка является небольшим, но информативным онлайн-ресурсом, который помогает установить контакт с потенциальными клиентами и повысить узнаваемость вашего бренда.',
                            price: '14000',
                            h2: 'Разработка сайта-визитки с гарантией!',
                            textMain: 'При разработке сайта-визитки необходимо учесть особенности вашего бизнеса и цели, которые вы хотите достичь. Наша команда экспертов веб-разработчиков обладает глубокими знаниями и опытом в создании сайтов-визиток для различных отраслей и бизнес-моделей. Мы тщательно анализируем ваши требования и проводим исследование вашего рынка, чтобы предложить вам оптимальное решение.<br>Индивидуальный дизайн и уникальностьМы понимаем, что ваш сайт-визитка должен выделяться среди конкурентов и привлекать внимание посетителей. Поэтому мы разрабатываем индивидуальный дизайн, соответствующий вашему бренду и корпоративному стилю. Наша команда дизайнеров создаст привлекательный внешний вид сайта, используя современные техники дизайна и интуитивно понятную навигацию, чтобы посетители легко могли найти нужную информацию.',
                            title: 'Разработка сайта-визитки в Волгограде по Выгодным ценам! компания SEO-FiRST', 
                            description: 'Закажите разработка сайта-визитки в нашей компании! Большое портфолио. Выполняем сложные и уникальные работы'
                        },
    'site-katalog': 
                        {
                            h1: 'Разработка сайта-каталога «под ключ»',
                            img: '13',
                            textUp: 'В современном цифровом мире, где все больше людей ищут продукты и услуги онлайн, наличие эффективного сайта-каталога становится ключевым фактором успеха для любого бизнеса. Сайт-каталог предоставляет возможность представить вашу компанию и продукты в наиболее удобной и информативной форме, позволяя клиентам получать необходимую информацию и делать покупки прямо на вашем веб-ресурсе.',
                            price: '28000',
                            h2: 'Разработка сайта-каталога с гарантией!',
                            textMain: 'Мы предлагаем профессиональную разработку сайта-каталога, которая полностью соответствует вашим потребностям и требованиям бизнеса. Наша команда опытных веб-разработчиков и дизайнеров тщательно анализирует вашу отрасль и цели, чтобы создать уникальный сайт-каталог, который привлечет внимание клиентов и обеспечит им легкий доступ к информации о ваших товарах и услугах.<br>Мы понимаем, что важно создать сайт-каталог с интуитивной навигацией, чтобы клиенты могли легко находить нужную информацию о ваших продуктах. Наша команда дизайнеров разработает привлекательный и современный дизайн, который отражает уникальность вашего бренда и делает пользовательский опыт приятным и удобным. Мы также обеспечим удобство использования на мобильных устройствах, чтобы ваш сайт-каталог был доступен в любое время и в любом месте.',
                            title: 'Разработка сайта-каталога в Волгограде по Выгодным ценам! компания SEO-FiRST', 
                            description: 'Закажите разработка сайта-каталога у нас! Большое портфолио. Выполняем сложные и уникальные работы. '
                        },
    'site-magazin':
                        {
                            h1: 'Разработка сайта-магазина «под ключ»',
                            img: '14',
                            textUp: 'В эпоху цифрового прогресса онлайн-магазины становятся важным инструментом для бизнеса, помогая предоставить продукты и услуги виртуальной аудитории и расширить свою клиентскую базу. Разработка эффективного и удобного сайта-магазина является ключевым фактором успеха в электронной коммерции. Мы предлагаем профессиональную разработку сайта-магазина, которая поможет вам создать превосходный онлайн-магазин и достичь ваших бизнес-целей.',
                            price: '38000',
                            h2: 'Разработка сайта-магазина с гарантией!',
                            textMain: 'Мы понимаем, что каждый бизнес уникален, и ваш сайт-магазин должен отражать уникальные особенности вашей компании и бренда. Наша команда профессиональных веб-разработчиков и дизайнеров разработает индивидуальное решение, соответствующее вашим потребностям и требованиям. Мы сосредотачиваемся на функциональности, чтобы обеспечить удобство навигации, управления продуктами и оформления заказов, а также интеграцию платежных систем для безопасных и эффективных онлайн-транзакций.<br>Ваш сайт-магазин должен привлекать внимание и создавать положительное впечатление у посетителей. Мы создадим привлекательный дизайн, отражающий ваш бренд и стиль, с учетом современных тенденций в дизайне интерфейсов. Мы также обеспечим удобство использования для ваших клиентов, разработав интуитивно понятную навигацию, удобный поиск и фильтры, а также улучшенный процесс оформления заказа, чтобы увеличить конверсию и удовлетворение покупателей.',
                            title: 'Разработка сайта-магазина в Волгограде по Выгодным ценам! компания SEO-FiRST', 
                            description: 'Закажите разработка сайта-магазина у нас! Большое портфолио. Выполняем сложные и уникальные работы.'
                        },

    'poiskovoe-prodvizenie':
                        {
                            h1: 'Поисковое продвижение «под ключ»',
                            img: '2',
                            textUp: 'Поисковое продвижение (SEO) является важной стратегией для достижения успеха в современном интернет-мире. Оно направлено на улучшение видимости веб-сайта в поисковых системах, таких как Google, Bing, Yahoo и других. Взаимодействие с SEO помогает компаниям и владельцам веб-сайтов привлекать больше органического трафика, улучшать ранжирование в поисковых результатах и повышать общую онлайн-присутствие.',
                            price: '12000',
                            h2: 'Поисковое продвижение с гарантией!',
                            textMain: 'Одной из ключевых составляющих поискового продвижения является оптимизация контента. Это означает создание высококачественного и релевантного контента, который отвечает на запросы пользователей и содержит ключевые слова и фразы, связанные с бизнесом или тематикой веб-сайта. Оптимизированный контент помогает поисковым системам лучше понять тематику сайта и релевантность его страниц для определенных поисковых запросов.<br>Еще одной важной частью SEO является внутренняя оптимизация веб-сайта. Это включает в себя оптимизацию заголовков страниц, мета-тегов, описаний, URL-адресов и других элементов, которые помогают поисковым системам понять структуру и содержание сайта. Правильная внутренняя оптимизация способствует лучшему индексированию страниц и повышает шансы на их отображение в выдаче поисковых системпокупателей.',
                            title: 'Поисковое SEO продвижение в Волгограде по Выгодным ценам! компания SEO-FiRST', 
                            description: 'Закажите поисковое SEO продвижение у нас! Большое портфолио. Выполняем сложные и уникальные работы.'
                        },
    'seo-prodvizenie-yandex':
                        {
                            h1: 'Поисковое продвижение в Яндекс «под ключ»',
                            img: '21',
                            textUp: 'Оптимизация контента для Яндекса имеет свои особенности. Во-первых, необходимо учитывать специфические требования и особенности алгоритма Яндекса. Он использует ряд факторов, таких как ключевые слова, семантическое ядро, показатели поведения пользователей, а также другие параметры для определения релевантности и качества веб-сайта. Поэтому важно проводить исследование ключевых слов, анализировать запросы пользователей и создавать контент, соответствующий их потребностям.',
                            price: '12000',
                            h2: 'Поисковое продвижение в Яндекс с гарантией!',
                            textMain: 'Поисковое продвижение в Яндексе является неотъемлемой частью успешной онлайн-стратегии для российских компаний и владельцев веб-сайтов. Яндекс является одной из ведущих поисковых систем в России и имеет значительную долю рынка поискового трафика.<br>Внутренняя оптимизация в Яндексе также имеет свои особенности. Заголовки страниц, мета-теги, описания, URL-адреса должны быть оптимизированы с учетом специфических требований Яндекса. Например, Яндекс обращает внимание на длину заголовков и описаний, рекомендуя ограничивать их определенными значениями. Кроме того, Яндекс активно использует семантическое ядро при индексации и ранжировании страниц. Поэтому важно подбирать правильные ключевые слова и фразы, связанные с тематикой сайта, для включения в тексты и мета-теги.',
                            title: 'Поисковое SEO продвижение в Яндекс в Волгограде по Выгодным ценам! компания SEO-FiRST', 
                            description: 'Закажите поисковое в Яндекс SEO продвижение у нас! Большое портфолио. Выполняем сложные и уникальные работы.'
                        },
    'seo-prodvizenie-google':
                        {
                            h1: 'Поисковое продвижение в Google «под ключ»',
                            img: '22',
                            textUp: 'Поисковое продвижение в Google является ключевой стратегией для достижения успеха в онлайн-мире. Google - ведущая поисковая система в мире, имеющая огромную долю рынка поискового трафика. Поэтому оптимизация веб-сайта под требования Google является неотъемлемой частью эффективной онлайн-стратегии.',
                            price: '12000',
                            h2: 'Поисковое продвижение в Google с гарантией!',
                            textMain: 'Оптимизация контента является одним из важных аспектов поискового продвижения в Google. Контент должен быть высококачественным, информативным и релевантным для целевой аудитории. Ключевые слова и фразы, связанные с тематикой веб-сайта, должны быть включены в тексты контента таким образом, чтобы они выглядели естественными и органическими. Оптимизированный контент помогает Google лучше понять тематику сайта и связывать его с соответствующими поисковыми запросами пользователей.<br>Внутренняя оптимизация веб-сайта также играет важную роль в SEO в Google. Заголовки страниц, мета-теги, описания, URL-адреса и другие элементы веб-сайта должны быть оптимизированы с учетом требований Google. Например, заголовки страниц должны быть информативными, уникальными и содержать ключевые слова. Мета-теги и описания должны быть привлекательными и содержать релевантные ключевые фразы. Также важно создавать чистую и логическую структуру сайта с понятными URL-адресами.',
                            title: 'Поисковое SEO продвижение в Гугл в Волгограде по Выгодным ценам! компания SEO-FiRST', 
                            description: 'Закажите поисковое в Гугл SEO продвижение у нас! Большое портфолио. Выполняем сложные и уникальные работы.'
                        },

    'digital-reklama':
                        {
                            h1: 'Разработка интернет рекламы «под ключ»',
                            img: '3',
                            textUp: 'Интернет-реклама является эффективным и популярным средством привлечения внимания к бренду, продукту или услуге в онлайн-среде. Она позволяет компаниям и владельцам бизнесов достичь широкой аудитории, улучшить узнаваемость и повысить конверсию.',
                            price: '20000',
                            h2: 'Лучшая интернет реклама!',
                            textMain: 'Одним из наиболее распространенных типов интернет-рекламы является контекстная реклама. Контекстная реклама показывается в поисковых системах, соответствуя запросам пользователей. Например, Google Ads и Яндекс.Директ позволяют размещать рекламные объявления на страницах результатов поиска, которые отображаются, когда пользователь вводит определенные ключевые слова. Это позволяет компаниям быть видимыми в момент, когда пользователи активно ищут продукты или услуги, связанные с их бизнесом.<br>Еще один популярный тип интернет-рекламы - баннерная реклама. Баннеры отображаются на веб-сайтах и могут содержать текст, изображения, анимацию или видео. Они могут быть размещены на специализированных рекламных площадках или на партнерских веб-сайтах, привлекая внимание пользователей и направляя их на сайт рекламодателя.',
                            title: 'Интернет реклама в Волгограде по Выгодным ценам! компания SEO-FiRST', 
                            description: 'Закажите интернет рекламу SEO продвижение у нас! Большое портфолио. Выполняем сложные и уникальные работы.'
                        },
    'yandex-direct':
                        {
                            h1: 'Разработка рекламной компании Яндекс.Директ «под ключ»',
                            img: '31',
                            textUp: 'Реклама в Яндекс.Директ представляет собой один из наиболее эффективных способов продвижения бизнеса и привлечения целевой аудитории в онлайн-среде. Яндекс.Директ - это рекламная платформа, предоставляемая Яндексом, позволяющая размещать контекстную рекламу на страницах поисковой выдачи, сайтах партнеров и в сети Яндекс.Рекламы.',
                            price: '20000',
                            h2: 'рекламная компания Яндекс.Директ',
                            textMain: 'Рекламные объявления могут быть настроены на отображение только для пользователей, соответствующих определенным критериям, таким как географическое расположение, язык, интересы, возраст и демографические данные. Это позволяет точно определить целевую аудиторию и показывать рекламу только тем пользователям, которые наиболее вероятно проявят интерес к вашим продуктам или услугам.<br>Оптимизация ключевых слов является ключевым аспектом рекламы в Яндекс.Директ. Рекламодатели могут выбирать ключевые слова и фразы, связанные с их бизнесом, чтобы показывать рекламу при поиске пользователей по этим запросам. Оптимизация ключевых слов включает в себя исследование и анализ ключевых слов, выбор релевантных запросов, управление ставками и качеством ключевых слов для достижения наилучших результатов.',
                            title: 'Разработка рекламной компании в Яндекс Директ в Волгограде по Выгодным ценам! компания SEO-FiRST', 
                            description: 'Закажите рекламную компанию в Яндекс Директ у нас! Большое портфолио. Выполняем сложные и уникальные работы.'
                        },

    'podderzka':
                        {
                            h1: 'Поддержка вашего сайта',
                            img: '4',
                            textUp: 'Поддержка сайта является важной составляющей успешного онлайн-присутствия. Она включает в себя ряд действий и услуг, направленных на обеспечение безопасности, функциональности и актуальности веб-сайта. Поддержка сайта помогает обеспечить его плавную работу, улучшить пользовательский опыт и обеспечить надежность работы веб-ресурса.',
                            price: '2000',
                            h2: 'Берем на поддержку сайты любой сложности!',
                            textMain: 'Одним из ключевых аспектов поддержки сайта является техническая поддержка. Она включает в себя обеспечение непрерывной работы сайта, мониторинг его доступности, обновление программного обеспечения и платформы, устранение технических проблем и ошибок. Техническая поддержка также включает резервное копирование данных, защиту от взломов и вирусов, а также обновление системы безопасности.<br>Контентовая поддержка также важна для поддержки сайта. Это включает в себя обновление и добавление нового контента на сайт, такого как статьи, новости, блоги, продуктовые описания и другие материалы. Регулярное обновление контента помогает привлечь посетителей, улучшить SEO-позиции и обеспечить актуальность информации на сайте',
                            title: 'Поддерка сайтов в Волгограде по Выгодным ценам! компания SEO-FiRST', 
                            description: 'Закажите поддержку вашего сайта у нас! Большое портфолио. Выполняем сложные и уникальные работы.'
                        },
    'dorabotka':
                        {
                            h1: 'Доработка сайта любой сложности',
                            img: '41',
                            textUp: 'Доработка сайта является важным этапом в его развитии и оптимизации. Она позволяет внести изменения, улучшить функциональность и удовлетворить потребности пользователей. Вот некоторые общие аспекты доработки сайтов: Дизайн и пользовательский интерфейс: Доработка дизайна может включать изменение цветовой схемы, шрифтов, компоновки элементов и общего внешнего вида сайта. Целью является создание привлекательного и интуитивно понятного пользовательского интерфейса, который обеспечивает позитивный пользовательский опыт.',
                            price: '5000',
                            h2: 'Доработка вашего сайта в срок!',
                            textMain: 'Доработка сайта с учетом SEO позволяет повысить его видимость в поисковых системах. Это может включать оптимизацию мета-тегов, заголовков, ключевых слов, URL-адресов, а также улучшение структуры сайта и внутренней ссылочной сети. Адаптивность и мобильная оптимизация: В наше время все больше людей используют мобильные устройства для доступа к интернету. Поэтому важно убедиться, что сайт полностью адаптирован и оптимизирован для просмотра на различных устройствах и разрешениях экранов.<br>Функциональность и возможности: Доработка сайта может включать расширение его функциональности. Это может быть добавление новых разделов, функций, форм обратной связи, онлайн-платежей, интеграции с социальными сетями и другими возможностями, которые позволят улучшить взаимодействие с посетителями сайта. Скорость загрузки: Оптимизация скорости загрузки сайта является важным аспектом доработки. Медленная загрузка может отпугнуть посетителей и отрицательно повлиять на пользовательский опыт. Проведение анализа и оптимизация элементов сайта, таких как изображения, код и серверные настройки, поможет ускорить загрузку страниц.',
                            title: 'Доработка сайта в Волгограде по Выгодным ценам! компания SEO-FiRST', 
                            description: 'Закажите доработку вашего сайта у нас! Большое портфолио. Выполняем сложные и уникальные работы.'
                        },
                    };

export default links;